from django.core.management.base import BaseCommand
from catalog.models import Tag

DEFAULT_TAGS = [
    "Головоломка",
    "Аркада",
    "Шутер",
    "Платформер",
    "Визуальная новелла",
    "Песочница",
    "Point and Click",
    "Образование",
    "Рогалик",
    "Для взрослых",
    "Настольная игра",
    "Японская ролевая игра",
    "Партийная ролевая игра",
    "Симулятор ходьбы",
    "Карточная игра",
    "Симулятор жизни",
    "Башенная защита",
    "Градостроение",
    "Beat 'em up",
    "Автосимулятор",
    "Глобальная стратегия",
    "Пошаговая стратегия",
    "Стратегия в реальном времени",
    "Ролевая стратегия",
    "Психологический хоррор",
    "Хоррор на выживание",
    "Ролевой экшен",
    "Приключенческий экшен",
    "Головоломка-платформер",
    "Шутер с видом сверху",
    "Тактическая ролевая игра",
    "Космический симулятор",
    "Ритм-игра",
    "Королевская битва",
    "Симулятор колонии",
    "Симулятор фермы",
    "MOBA",
]

class Command(BaseCommand):
    help = 'Добавляет стандартные теги в базу данных'

    def handle(self, *args, **kwargs):
        added = 0
        for tag_name in DEFAULT_TAGS:
            tag, created = Tag.objects.get_or_create(name=tag_name)
            if created:
                added += 1
        self.stdout.write(self.style.SUCCESS(f'Добавлено новых тегов: {added}'))
